<%-- 
Функционал сайта
===============
Для не зареганых пользователя

Регистрация
Просмотр комплектующих для ПК
Добавлять товар в корзину
Оплачивать товар
Проверять ПК на балансную сборку(но это не точно)
===============
Для зарегестрированых

Редактировать свой профиль
Оставлять коменты
Получать уведомления о скидках и новых товарах
оценивать товар(но это не точно)
===============
Для администратора

Добавлять новые комплектующие
Редактировать товар
Редактировать профиль пользователей(но это не точно)
блокировать пользователей(но это не точно)
удалять чужие комментарии(но это не точно)
===============
Component
Person
--%>
<%-- 
    Document   : index
    Created on : Jan 14, 2020, 3:01:07 PM
    Author     : pupil
--%>
<%@page contentType="text/html" pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
    <head>
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
        <title>computeruniverse</title>
    </head>
    <body>
        <h1>Computeruniverse</h1>
        <a href="showAddComponent">Добавить компонент</a>
        <a href="listComponent">Список компонентов</a>
    </body>
</html>
